rtrisnoj/Weather_Station_AMIRTU/us3_mshield/us3_mshield/ArduinoCore/include/variants/variant.h
/*
MY DECLARATION
By: Ryan Trisnojoyo
Date: 08/19/2019
*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#define PIN_A0					(2ul)		//PA02
#define PIN_AREF				(3ul)		//PA03
#define PIN_A1					(0ul)		//PB08
#define PIN_A2					(1ul)		//PB09
#define PIN_A3					(4ul)		//PA04
#define PIN_A4					(5ul)		//PA05
#define PIN_D10					(6ul)		//PA06
#define PIN_D11					(7ul)		//PA07

#define PIN_D0					(8ul)		//PA08
#define PIN_MILLI_WAKE			(9ul)		//PA09
#define PIN_MCU_TX				(10u)		//PA10
#define PIN_MCU_RX				(11u)		//PA11
#define PIN_USB_HOST_EN			(14u)		//PB10
#define PIN_D8					(15ul)		//PB11
#define PIN_D9					(12ul)		//PA12
#define FLASH_CS				(13u)		//PA13
//#define PIN_HOST_WAKE			() //there is not PA14 in variant.cpp
		
#define PIN_D6					(16ul)		//PA16
#define PIN_D7					(17ul)		//PA17
#define PIN_D3					(18ul)		//PA18
#define PIN_D5					(19ul)		//PA19
#define PIN_D4					(20ul)		//PA20
#define PIN_D2					(21ul)		//PA21
#define PIN_SDA					(22u)		//PA22
#define PIN_SCL					(23u)		//PA23
#define PIN_D_M					(24u)		//PA24
#define PIN_D_P					(25u)		//PA25

#define FLASH_MOSI				(32u)		//PB22
#define FLASH_SCK				(33u)		//PB23
#define PIN_X					(30u)		//NEOPIX/SWCLK (PA30)
#define PIN_Y					(31u)		//RXLED/SWDIO	(PA31)
#define PIN_A5					(34ul)		//PB02
#define FLASH_MISO				(35u)		//PB03	
#define PIN_D1					(36ul)


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

static const uint8_t A0		=	PIN_A0;
static const uint8_t AREF	=	PIN_AREF;
static const uint8_t A1		=	PIN_A1;
static const uint8_t A2		=	PIN_A2;
static const uint8_t A3		=	PIN_A3;
static const uint8_t A4		=	PIN_A4;
static const uint8_t D10	=	PIN_D10;
static const uint8_t D11	=	PIN_D11;

static const uint8_t D0		=	PIN_D0;
static const uint8_t D8		=	PIN_D8;
static const uint8_t D9		=	PIN_D9;

static const uint8_t D6		=	PIN_D6;
static const uint8_t D7		=	PIN_D7;
static const uint8_t D3		=	PIN_D3;
static const uint8_t D5		=	PIN_D5;
static const uint8_t D4		=	PIN_D4;
static const uint8_t D2		=	PIN_D2;

static const uint8_t A5		=	PIN_A5;
static const uint8_t D1		=	PIN_D1;
////////////////////////////////////////////////
/*
 * Analog pins
 */

/*
#define PIN_A0               (0ul)
#define PIN_A1               (1ul)
#define PIN_A2               (2ul)
#define PIN_A3               (3ul)
#define PIN_A4               (4ul)
#define PIN_A5               (5ul)
#define PIN_A6               (6ul)
#define PIN_A7               (7ul)
#define PIN_A8               (8ul)
#define PIN_A9               (9ul)
#define PIN_A10              (10ul)
#define PIN_A11              (11ul)
#define PIN_A34              (34ul)
#define PIN_A35              (35ul)
#define PIN_DAC0             (2ul)
#if (SAMD51 || SAML21)
#define PIN_DAC1             (5ul)
#endif

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A4   = PIN_A4;
static const uint8_t A5   = PIN_A5;
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A11  = PIN_A11;
static const uint8_t A34  = PIN_A34;
static const uint8_t A35  = PIN_A35;
static const uint8_t DAC0 = PIN_DAC0;
#if (SAMD51 || SAML21)
static const uint8_t DAC1 = PIN_DAC1;
#endif
*/


#define ADC_RESOLUTION		12

// #define REMAP_ANALOG_PIN_ID(pin)	if ( pin < A0 ) pin += A0

/* Set default analog voltage reference */
#define VARIANT_AR_DEFAULT	AR_DEFAULT

/* Reference voltage pins (define even if not enabled with PIN_ATTR_REF in the PinDescription table) */
#define REFA_PIN    (3ul)
#define REFB_PIN    (4ul)
#if (SAMD51)
#define REFC_PIN    (6ul)
#endif


// The ATN pin may be used in the future as the first SPI chip select.
// On boards that do not have the Arduino physical form factor, it can to set to any free pin.
#define PIN_ATN              (27ul)
static const uint8_t ATN = PIN_ATN;


/*
 * Serial interfaces
 */
#if (defined(THREE_UART) && SAMD51)
  #error "variant.h: Only two UARTs are available with the D51. Please choose a TWO_UART_* option"
#endif

// Serial1
#define PIN_SERIAL1_TX       (0ul)
#define PIN_SERIAL1_RX       (1ul)
#define PAD_SERIAL1_TX       (UART_TX_PAD_0)
#define PAD_SERIAL1_RX       (SERCOM_RX_PAD_1)

#define SERCOM_INSTANCE_SERIAL1       &sercom4

/*
// Serial1
#define PIN_SERIAL1_TX       (PIN_D10)
#define PIN_SERIAL1_RX       (PIN_D11)
#define PAD_SERIAL1_TX       (UART_TX_PAD_2)
#define PAD_SERIAL1_RX       (SERCOM_RX_PAD_3)

#define SERCOM_INSTANCE_SERIAL1       &sercom0
*/
// Serial2
//#define PIN_SERIAL2_TX       (12u)
//#define PIN_SERIAL2_RX       (13u)
#define PIN_SERIAL2_TX       (PIN_MCU_TX)				//ryan
#define PIN_SERIAL2_RX       (PIN_MCU_RX)				//ryan
#define PAD_SERIAL2_TX       (UART_TX_PAD_2)			//ryan
#define PAD_SERIAL2_RX       (SERCOM_RX_PAD_3)			//ryan

#define SERCOM_INSTANCE_SERIAL2       &sercom2

// Serial3 (a third serial is not available with the D51 on this board)
/*
#define PIN_SERIAL3_TX       (18ul)
#define PIN_SERIAL3_RX       (19ul)
#define PAD_SERIAL3_TX       (UART_TX_PAD_2)
#define PAD_SERIAL3_RX       (SERCOM_RX_PAD_3)

#define SERCOM_INSTANCE_SERIAL3       &sercom3
*/
/*
#define PIN_SERIAL3_TX       (PIN_D10)
#define PIN_SERIAL3_RX       (PIN_D11)
#define PAD_SERIAL3_TX       (UART_TX_PAD_2)
#define PAD_SERIAL3_RX       (SERCOM_RX_PAD_3)

#define SERCOM_INSTANCE_SERIAL3       &sercom0
*/

#define PIN_SERIAL3_TX       (PIN_D3)
#define PIN_SERIAL3_RX       (PIN_D2)
#define PAD_SERIAL3_TX       (UART_TX_PAD_2)
#define PAD_SERIAL3_RX       (SERCOM_RX_PAD_3)

#define SERCOM_INSTANCE_SERIAL3       &sercom3
/*
#define PIN_SERIAL3_TX       (PIN_SDA)
#define PIN_SERIAL3_RX       (PIN_SCL)
#define PAD_SERIAL3_TX       (UART_TX_PAD_0)
#define PAD_SERIAL3_RX       (SERCOM_RX_PAD_1)

#define SERCOM_INSTANCE_SERIAL3       &sercom3
*/

