rtrisnoj/Weather_Station_AMIRTU/us3_mshield/us3_mshield/ArduinoCore/include/variants/variant.h
/*
 * SPI Interfaces
 */
#if defined(TWO_SPI)
#define SPI_INTERFACES_COUNT 2
#elif defined(THREE_SPI)
#define SPI_INTERFACES_COUNT 3
#else
#define SPI_INTERFACES_COUNT 1
#endif

static const uint8_t SS   = FLASH_CS ;        // The SERCOM SS PAD is available on this pin but HW SS isn't used. Set here only for reference. //RYAN
static const uint8_t MOSI = FLASH_MOSI ;	//RYAN
static const uint8_t MISO = FLASH_MISO ;	//RYAN
static const uint8_t SCK  = FLASH_SCK ;		//RYAN

#define PIN_SPI_MISO         MISO
#define PIN_SPI_MOSI         MOSI
#define PIN_SPI_SCK          SCK
#define PIN_SPI_SS           SS

#define PERIPH_SPI           sercom5
#define PAD_SPI_TX           SPI_PAD_2_SCK_3
#define PAD_SPI_RX           SERCOM_RX_PAD_1

/*
#if (SAMD51)
#define PIN_SPI1_MISO         (21u)
#define PIN_SPI1_MOSI         (23u)
#define PIN_SPI1_SCK          (22u)
#define PIN_SPI1_SS           (20u)
#define PAD_SPI1_TX           SPI_PAD_0_SCK_1
#define PAD_SPI1_RX           SERCOM_RX_PAD_3
#else
#define PIN_SPI1_MISO         (21u)
#define PIN_SPI1_MOSI         (22u)
#define PIN_SPI1_SCK          (23u)
#define PIN_SPI1_SS           (20u)
#define PAD_SPI1_TX           SPI_PAD_0_SCK_1
#define PAD_SPI1_RX           SERCOM_RX_PAD_3
#endif
#define PERIPH_SPI1           sercom5

static const uint8_t SS1   = PIN_SPI1_SS ;	// The SERCOM SS PAD is available on this pin but HW SS isn't used. Set here only for reference.
static const uint8_t MOSI1 = PIN_SPI1_MOSI ;
static const uint8_t MISO1 = PIN_SPI1_MISO ;
static const uint8_t SCK1  = PIN_SPI1_SCK ;
*/

/*
 * Wire Interfaces
 */


#define PIN_WIRE_SDA         (PIN_SDA)			//(22u)			//RYAN
#define PIN_WIRE_SCL         (PIN_SCL)			//(23u)			//RYAN
#define PERIPH_WIRE          sercom5

#if (SAMD51)
  #define WIRE_STOP_DETECTED_HANDLER      SERCOM5_0_Handler
  #define WIRE_ADDRESS_MATCH_HANDLER      SERCOM5_1_Handler
  #define WIRE_DATA_READY_HANDLER         SERCOM5_2_Handler
#else
  #define WIRE_IT_HANDLER      SERCOM5_Handler
#endif


#if defined(TWO_WIRE)
#define WIRE_INTERFACES_COUNT 2
#elif defined(THREE_WIRE)
#define WIRE_INTERFACES_COUNT 3
#else
#define WIRE_INTERFACES_COUNT 1
#endif

#define PIN_WIRE1_SDA         (16u)
#define PIN_WIRE1_SCL         (17u)
#define PERIPH_WIRE1         sercom1
#if (SAMD51)
  #define WIRE1_STOP_DETECTED_HANDLER      SERCOM1_0_Handler
  #define WIRE1_ADDRESS_MATCH_HANDLER      SERCOM1_1_Handler
  #define WIRE1_DATA_READY_HANDLER         SERCOM1_2_Handler
#else
  #define WIRE1_IT_HANDLER      SERCOM1_Handler
#endif


static const uint8_t SDA1 = PIN_WIRE1_SDA;
static const uint8_t SCL1 = PIN_WIRE1_SCL;


/*
 * USB - Define PIN_USB_HOST_ENABLE to assert the defined pin to
 * PIN_USB_HOST_ENABLE_VALUE during startup. Leave undefined to disable this pin.
 */
#define PIN_USB_DM                      (PIN_D_M)				//(24ul)			//RYAN
#define PIN_USB_DP                      (PIN_D_P)				//(25ul)			//RYAN
//#define PIN_USB_HOST_ENABLE             (19ul)
#define PIN_USB_HOST_ENABLE_VALUE	PIN_USB_HOST_EN				//0				//RYAN

/*
 * I2S Interfaces
 * SAMD51, PDM, and MCLK support will be added hopefully March 2018
 */

#if (SAMD51)
// On the SAMD51, device 0 is TX only using SDO (PIN_I2S_SD), and device 1 is RX only using SDI (PIN_I2S1_SD)
#define I2S_INTERFACES_COUNT  2
#define I2S_DEVICE            0
#define I2S1_DEVICE           1
#define I2S_CLOCK_GENERATOR   7
#define I2S1_CLOCK_GENERATOR  7
// TX
#define PIN_I2S_MCK         (8u)
//RT #define PIN_I2S_SCK         (10u)
//RT #define PIN_I2S_FS          (9u)
//RT #define PIN_I2S_SD          (11u)       // SDO (TX)
// RX (must use clock 0)
#define PIN_I2S1_MCK         (8u)
//#define PIN_I2S1_SCK         (10u)
//#define PIN_I2S1_FS          (9u)
#define PIN_I2S1_SD          (14u)       // SDI (RX)

#else
#define I2S_INTERFACES_COUNT  1
#define I2S_DEVICE            0
//#define I2S1_DEVICE           1
#define I2S_CLOCK_GENERATOR   7
//#define I2S1_CLOCK_GENERATOR  8
//#define PIN_I2S_MCK         (9u)
#define PIN_I2S_SCK         (20u)
#define PIN_I2S_FS          (21u)
#define PIN_I2S_SD          (19u)
//#define PIN_I2S1_MCK         (10u)
//#define PIN_I2S1_SCK         (11u)
//#define PIN_I2S1_SD          (8u)
#endif

#ifdef __cplusplus
}
#endif


/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
*/
extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom3;
extern SERCOM sercom4;
extern SERCOM sercom5;

extern Uart Serial1;
extern Uart Serial2;
#if (SAMD21 || SAMC21 || SAML21)
extern Uart Serial3;
#endif

#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#if (!SAMC21)
  #define SERIAL_PORT_USBVIRTUAL      SerialUSB
#endif
// SERIAL_PORT_MONITOR seems to be used only by the USB Host library (as of 1.6.5).
// It normally allows debugging output on the USB programming port, while the USB host uses the USB native port.
// The programming port is connected to a hardware UART through a USB-Serial bridge (EDBG chip) on the Zero.
// Boards that do not have the EDBG chip will have to connect a USB-TTL serial adapter to 'Serial' to get
// the USB Host debugging output.
#if (SAMC21)
  #define SERIAL_PORT_MONITOR         Serial2
#else
  #define SERIAL_PORT_MONITOR         Serial1
#endif

// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#if (SAMC21)
  #define SERIAL_PORT_HARDWARE        Serial2
  #define SERIAL_PORT_HARDWARE_OPEN   Serial2
#else
  #define SERIAL_PORT_HARDWARE        Serial1
  #define SERIAL_PORT_HARDWARE_OPEN   Serial1
#endif

// The Xeno does not have the EDBG support chip, which provides a USB-UART bridge
// accessible using Serial (the Arduino serial monitor is normally connected to this).
// So, the USB virtual serial port (SerialUSB) must be used to communicate with the host.
// Because most sketches use Serial to print to the monitor, it is aliased to SerialUSB.
// Remember to use while(!Serial); to wait for a connection before Serial printing.
#if (SAMC21)
  #define Serial                      Serial1
#else
  // When USB CDC is enabled, Serial refers to SerialUSB, otherwise it refers to Serial1.
  #if defined(CDC_ONLY) || defined(CDC_HID) || defined(WITH_CDC)
    #define Serial                      SerialUSB
  #else
    #define Serial                      Serial1
  #endif
#endif

#endif /* _VARIANT_MATTAIRTECH_XENO_MINI_ */
